{
    "title": "Building OrthoPhoto: Clinical Photography Without Subscriptions",
    "date": "December 15, 2025",
    "tags": "Mobile Development, iOS, React Native, Clinical Photography",
    "intro": "When a dentist friend approached me with a simple request—\"I need an app to take standardized clinical photos without monthly fees\"—I knew this was a perfect opportunity to build something practical and useful. OrthoPhoto was born from a real need: dental professionals wanted a streamlined way to capture, organize, and export clinical documentation without the burden of subscriptions, accounts, or complicated workflows.",
    "problem-title": "The Problem",
    "problem-desc": "Clinical photography in dentistry requires consistency and precision. Dentists need to capture specific angles—intra-oral shots, facial views, and arch photos—for every patient. The existing solutions were either too expensive with recurring subscription fees, overly complex for staff to use, or required tedious manual organization and editing afterward. My friend wanted something simple: hand the phone to any team member, follow the guided prompts, and get a professional composite document ready to share with specialists or add to patient records.",
    "solution-title": "The Solution",
    "solution-desc": "OrthoPhoto is an iOS app built with React Native and Expo SDK 54 that transforms an iPhone into a professional clinical photography tool. The app guides users through a standardized capture sequence, automatically arranges photos into a clinical composite grid, and exports everything as PDF, JPEG, or individual images—all processed locally on the device with no account required.",
    "screenshot1-caption": "Home screen with language selection and quick start",
    "screenshot2-caption": "Guided capture flow with template overlays",
    "screenshot3-caption": "Review and export screen with patient information",
    "screenshot4-caption": "Flexible export options: PDF, JPEG, or individual photos",
    "features-title": "Core Features",
    "feature1-title": "Guided Capture Flow",
    "feature1-desc": "Step-by-step prompts for all required clinical shots: arches, intra-oral angles, and facial views. Template overlays help ensure consistent framing every time.",
    "feature2-title": "Smart Cropping",
    "feature2-desc": "Custom cropper with pinch-to-zoom, pan, rotation slider, and adjustable handles. Powered by expo-image-manipulator for precise edits.",
    "feature3-title": "Patient Management",
    "feature3-desc": "Simple patient info entry: name and date of birth. The app automatically calculates age for accurate documentation.",
    "feature4-title": "Flexible Export",
    "feature4-desc": "Export as PDF with precise cm-based layout, composite JPEG via react-native-view-shot, or save individual photos to gallery.",
    "feature5-title": "Multi-Language Support",
    "feature5-desc": "Full localization in English, French, German, and Italian. Language preference persists across sessions via AsyncStorage.",
    "feature6-title": "Privacy First",
    "feature6-desc": "All processing happens locally on your device. No accounts, no cloud storage, no data leaves your phone without your permission.",
    "tech-title": "Technical Implementation",
    "tech-stack-title": "Technology Stack",
    "tech-stack-desc": "OrthoPhoto is built with React Native 0.81.5, React 19.1.0, and Expo SDK ~54. This stack provides native performance while allowing rapid development and easy updates. Key libraries include:",
    "tech-item1": "expo-camera: High-quality photo capture with auto-resize",
    "tech-item2": "expo-image-manipulator: Precise cropping and rotation",
    "tech-item3": "react-native-view-shot: Composite image generation",
    "tech-item4": "expo-file-system: PDF generation with cm-based precision",
    "tech-item5": "AsyncStorage: Persistent language preferences",
    "capture-flow-title": "Capture Flow Design",
    "capture-flow-desc": "The capture flow is a guided sequence that ensures no required shot is missed. Users see template overlays for each angle, making it easy to frame photos consistently. The app uses gating logic to ensure a photo exists before advancing, and offers retake/crop options at every step. When returning from the review screen, the app switches to single-capture mode for replacing specific slots.",
    "export-title": "Export System",
    "export-desc": "The export system is designed for professional use. PDFs use precise cm-based placement with a header containing patient metadata (name, DOB, age, and date). The layout mirrors the review screen: dental photos in a left grid, facial photos in a right grid. JPEG exports use react-native-view-shot to capture the entire layout as a single image, while individual photo exports save each image to the device gallery.",
    "i18n-title": "Internationalization",
    "i18n-desc": "Full localization was a priority from day one. The app supports English, French, German, and Italian across all UI labels, capture prompts, export dialogs, and units. The system bootstraps from the device locale with a fallback to English, and user preferences are stored in AsyncStorage for persistence. The home screen features an animated logo and a language switcher with flag emojis (🇺🇸/🇫🇷/🇩🇪/🇮🇹).",
    "challenges-title": "Challenges and Solutions",
    "challenge1-title": "PDF Generation on iOS",
    "challenge1-desc": "Generating PDFs with precise layout control on iOS required careful work with expo-file-system. I implemented a cm-based coordinate system to ensure professional-quality output that matches printed standards. The challenge was converting between screen coordinates and PDF points while maintaining image quality and aspect ratios.",
    "challenge2-title": "Image Cropping UX",
    "challenge2-desc": "Creating an intuitive cropping interface was crucial. I built a custom modal cropper with pinch/zoom/pan gestures, a rotation slider, and adjustable crop handles. The challenge was making it feel natural while providing precise control—especially important for clinical photos where framing matters.",
    "challenge3-title": "Capture Flow State Management",
    "challenge3-desc": "Managing the capture flow state—knowing which photos exist, handling retakes, and switching between sequential capture and single-shot replacement—required careful state management. I implemented gating logic to prevent advancing without a photo, and mode switching to handle different navigation patterns.",
    "lessons-title": "Lessons Learned",
    "lesson1-title": "User-Centered Design",
    "lesson1-desc": "Building for a specific user (a dentist) with clear requirements taught me the value of focused design. Instead of adding features \"just in case,\" I concentrated on making the core workflow as smooth as possible. The result is an app that does one thing extremely well.",
    "lesson2-title": "Local-First Architecture",
    "lesson2-desc": "Processing everything locally eliminated privacy concerns, reduced complexity, and removed dependencies on backend infrastructure. This architectural choice made the app faster, more reliable, and easier to maintain—while also being a key selling point for privacy-conscious medical professionals.",
    "lesson3-title": "Expo's Power for Rapid Development",
    "lesson3-desc": "Expo SDK proved invaluable for rapid iteration. Features like expo-camera, expo-image-manipulator, and expo-file-system provided robust, well-tested solutions that would have taken weeks to implement from scratch. The managed workflow allowed me to focus on the user experience rather than low-level native code.",
    "conclusion-title": "Conclusion",
    "conclusion-p1": "Building OrthoPhoto was a rewarding experience in solving a real-world problem with modern mobile technology. The app demonstrates that you don't need complex backend infrastructure or subscription models to deliver professional-grade tools. Sometimes the best solution is the simplest one: a focused app that does exactly what users need, with no extra friction.",
    "conclusion-p2": "The project reinforced my belief in user-centered design, local-first architecture, and the power of modern cross-platform frameworks like React Native and Expo. If you're a dental professional looking for a straightforward clinical photography solution, or a developer interested in building practical mobile apps, I hope OrthoPhoto serves as a useful example.",
    "conclusion-p3": "OrthoPhoto is currently available for iOS. Visit the website to learn more and download the app from the App Store.",
    "back-link": "Back to Blog"
}