{
  "meta": {
    "title": "Créer OrthoPhoto : Photographie Clinique Sans Abonnement | Seb Hausmann",
    "tags": "Développement Mobile, iOS, React Native, Photographie Clinique"
  },
  "nav": {
    "home": "Accueil",
    "projects": "Projets",
    "blog": "Blog",
    "contact": "Contact"
  },
  "header": {
    "title": "Créer OrthoPhoto : Photographie Clinique Sans Abonnement",
    "date": "15 décembre 2025"
  },
  "footer": {
    "backLink": "Retour au Blog",
    "copyright": "2025 <span class=\"easter-egg-trigger\" style=\"cursor: pointer;\">Seb</span> Hausmann. Tous droits réservés."
  },
  "common": {
    "backToTop": "Retour en haut",
    "toggleDarkMode": "Basculer en mode sombre"
  },
  "content": {
    "altText": {
      "appIcon": "Icône de l'application OrthoPhoto",
      "homeScreen": "Écran d'accueil OrthoPhoto",
      "captureFlow": "Flux de capture OrthoPhoto",
      "reviewScreen": "Écran de révision OrthoPhoto",
      "exportOptions": "Options d'export OrthoPhoto"
    }
  },
  "title": "Créer OrthoPhoto : Photographie Clinique Sans Abonnement",
  "date": "15 décembre 2025",
  "tags": "Développement Mobile, iOS, React Native, Photographie Clinique",
  "intro": "Quand un ami dentiste m'a approché avec une demande simple—\"J'ai besoin d'une application pour prendre des photos cliniques standardisées sans frais mensuels\"—j'ai su que c'était l'occasion parfaite de créer quelque chose de pratique et utile. <a href=\"https://v0-orthophoto.vercel.app/\" target=\"_blank\" rel=\"noopener\">OrthoPhoto</a> est né d'un besoin réel : les professionnels dentaires voulaient un moyen simplifié de capturer, organiser et exporter la documentation clinique sans le fardeau des abonnements, des comptes ou des flux de travail compliqués.",
  "problem-title": "Le Problème",
  "problem-desc": "La photographie clinique en dentisterie nécessite cohérence et précision. Les dentistes doivent capturer des angles spécifiques—vues intra-orales, vues faciales et photos d'arcades—pour chaque patient. Les solutions existantes étaient soit trop coûteuses avec des frais d'abonnement récurrents, trop complexes pour le personnel, ou nécessitaient une organisation et une édition manuelles fastidieuses par la suite. Mon ami voulait quelque chose de simple : confier le téléphone à n'importe quel membre de l'équipe, suivre les invites guidées et obtenir un document composite professionnel prêt à partager avec des spécialistes ou à ajouter aux dossiers des patients.",
  "solution-title": "La Solution",
  "solution-desc": "<a href=\"https://v0-orthophoto.vercel.app/\" target=\"_blank\" rel=\"noopener\">OrthoPhoto</a> est une application iOS construite avec React Native et Expo SDK 54 qui transforme un iPhone en outil professionnel de photographie clinique. L'application guide les utilisateurs à travers une séquence de capture standardisée, organise automatiquement les photos dans une grille composite clinique, et exporte tout en PDF, JPEG ou images individuelles—le tout traité localement sur l'appareil sans compte requis.",
  "screenshot1-caption": "Écran d'accueil avec sélection de langue et démarrage rapide",
  "screenshot2-caption": "Flux de capture guidé avec superpositions de modèles",
  "screenshot3-caption": "Écran de révision et d'export avec informations patient",
  "screenshot4-caption": "Options d'export flexibles : PDF, JPEG ou photos individuelles",
  "features-title": "Fonctionnalités Principales",
  "feature1-title": "Flux de Capture Guidé",
  "feature1-desc": "Invites étape par étape pour toutes les prises cliniques requises : arcades, angles intra-oraux et vues faciales. Les superpositions de modèles aident à garantir un cadrage cohérent à chaque fois.",
  "feature2-title": "Recadrage Intelligent",
  "feature2-desc": "Recadreur personnalisé avec pincement pour zoomer, panoramique, curseur de rotation et poignées ajustables. Propulsé par expo-image-manipulator pour des modifications précises.",
  "feature3-title": "Gestion des Patients",
  "feature3-desc": "Saisie simple des informations patient : nom et date de naissance. L'application calcule automatiquement l'âge pour une documentation précise.",
  "feature4-title": "Export Flexible",
  "feature4-desc": "Export en PDF avec mise en page précise en cm, JPEG composite via react-native-view-shot, ou sauvegarde des photos individuelles dans la galerie.",
  "feature5-title": "Support Multi-Langues",
  "feature5-desc": "Localisation complète en anglais, français, allemand et italien. La préférence linguistique persiste entre les sessions via AsyncStorage.",
  "feature6-title": "Confidentialité d'Abord",
  "feature6-desc": "Tout le traitement se fait localement sur votre appareil. Pas de comptes, pas de stockage cloud, aucune donnée ne quitte votre téléphone sans votre permission.",
  "tech-title": "Implémentation Technique",
  "tech-stack-title": "Stack Technologique",
  "tech-stack-desc": "<a href=\"https://v0-orthophoto.vercel.app/\" target=\"_blank\" rel=\"noopener\">OrthoPhoto</a> est construit avec React Native 0.81.5, React 19.1.0 et Expo SDK ~54. Cette stack offre des performances natives tout en permettant un développement rapide et des mises à jour faciles. Les bibliothèques clés incluent :",
  "tech-item1": "expo-camera : Capture photo haute qualité avec redimensionnement automatique",
  "tech-item2": "expo-image-manipulator : Recadrage et rotation précis",
  "tech-item3": "react-native-view-shot : Génération d'images composites",
  "tech-item4": "expo-file-system : Génération PDF avec précision en cm",
  "tech-item5": "AsyncStorage : Préférences linguistiques persistantes",
  "capture-flow-title": "Conception du Flux de Capture",
  "capture-flow-desc": "Le flux de capture est une séquence guidée qui garantit qu'aucune prise requise n'est manquée. Les utilisateurs voient des superpositions de modèles pour chaque angle, facilitant le cadrage cohérent des photos. L'application utilise une logique de contrôle pour s'assurer qu'une photo existe avant d'avancer, et offre des options de reprise/recadrage à chaque étape. Lors du retour depuis l'écran de révision, l'application passe en mode capture unique pour remplacer des emplacements spécifiques.",
  "export-title": "Système d'Export",
  "export-desc": "Le système d'export est conçu pour un usage professionnel. Les PDF utilisent un placement précis en cm avec un en-tête contenant les métadonnées du patient (nom, date de naissance, âge et date). La mise en page reflète l'écran de révision : photos dentaires dans une grille à gauche, photos faciales dans une grille à droite. Les exports JPEG utilisent react-native-view-shot pour capturer toute la mise en page en une seule image, tandis que les exports de photos individuelles sauvegardent chaque image dans la galerie de l'appareil.",
  "i18n-title": "Internationalisation",
  "i18n-desc": "La localisation complète était une priorité dès le premier jour. L'application prend en charge l'anglais, le français, l'allemand et l'italien pour toutes les étiquettes d'interface, les invites de capture, les dialogues d'export et les unités. Le système démarre à partir des paramètres régionaux de l'appareil avec un repli sur l'anglais, et les préférences utilisateur sont stockées dans AsyncStorage pour la persistance. L'écran d'accueil présente un logo animé et un sélecteur de langue avec des emojis de drapeaux (🇺🇸/🇫🇷/🇩🇪/🇮🇹).",
  "challenges-title": "Défis et Solutions",
  "challenge1-title": "Génération de PDF sur iOS",
  "challenge1-desc": "Générer des PDF avec un contrôle précis de la mise en page sur iOS a nécessité un travail minutieux avec expo-file-system. J'ai implémenté un système de coordonnées en cm pour garantir une sortie de qualité professionnelle conforme aux standards d'impression. Le défi consistait à convertir entre les coordonnées d'écran et les points PDF tout en maintenant la qualité et les ratios des images.",
  "challenge2-title": "UX du Recadrage d'Images",
  "challenge2-desc": "Créer une interface de recadrage intuitive était crucial. J'ai construit un recadreur modal personnalisé avec gestes de pincement/zoom/pan, un curseur de rotation et des poignées ajustables. Le défi était de le rendre naturel tout en offrant un contrôle précis—essentiel pour des photos cliniques où le cadrage compte.",
  "challenge3-title": "Gestion d'État du Flux de Capture",
  "challenge3-desc": "Gérer l'état du flux de capture—savoir quelles photos existent, gérer les reprises et basculer entre capture séquentielle et remplacement ponctuel—nécessitait une gestion d'état soignée. J'ai mis en place une logique de contrôle pour empêcher l'avancement sans photo et un mode commutable pour gérer différents parcours de navigation.",
  "lessons-title": "Leçons Retenues",
  "lesson1-title": "Design Centré Utilisateur",
  "lesson1-desc": "Construire pour un utilisateur précis (un dentiste) avec des exigences claires m'a appris la valeur d'un design focalisé. Au lieu d'ajouter des fonctionnalités \"au cas où\", je me suis concentré sur la fluidité du flux principal. Le résultat est une application qui fait extrêmement bien une chose précise.",
  "lesson2-title": "Architecture Local-First",
  "lesson2-desc": "Traiter tout localement a éliminé les préoccupations de confidentialité, réduit la complexité et supprimé la dépendance à une infrastructure backend. Ce choix architectural a rendu l'application plus rapide, plus fiable et plus simple à maintenir—et constitue aussi un argument clé pour les professionnels de santé soucieux de confidentialité.",
  "lesson3-title": "La Puissance d'Expo pour le Développement Rapide",
  "lesson3-desc": "Le SDK Expo s'est révélé inestimable pour l'itération rapide. Des fonctionnalités comme expo-camera, expo-image-manipulator et expo-file-system ont fourni des solutions robustes et éprouvées qui auraient pris des semaines à développer à partir de zéro. Le workflow géré m'a permis de me concentrer sur l'expérience utilisateur plutôt que sur du code natif bas niveau.",
  "conclusion-title": "Conclusion",
  "conclusion-p1": "Construire <a href=\"https://v0-orthophoto.vercel.app/\" target=\"_blank\" rel=\"noopener\">OrthoPhoto</a> a été une expérience gratifiante pour résoudre un problème réel avec les technologies mobiles modernes. L'application démontre qu'il n'est pas nécessaire d'avoir une infrastructure backend complexe ou des modèles d'abonnement pour offrir des outils de niveau professionnel. Parfois, la meilleure solution est la plus simple : une application focalisée qui fait exactement ce dont les utilisateurs ont besoin, sans friction supplémentaire.",
  "conclusion-p2": "Le projet a renforcé ma conviction dans le design centré utilisateur, l'architecture local-first et la puissance des frameworks multiplateformes modernes comme React Native et Expo. Si vous êtes un professionnel dentaire à la recherche d'une solution simple de photographie clinique, ou un développeur intéressé par la création d'applications mobiles pratiques, j'espère que <a href=\"https://v0-orthophoto.vercel.app/\" target=\"_blank\" rel=\"noopener\">OrthoPhoto</a> servira d'exemple utile.",
  "conclusion-p3": "<a href=\"https://v0-orthophoto.vercel.app/\" target=\"_blank\" rel=\"noopener\">OrthoPhoto</a> est actuellement disponible sur iOS. Visitez le <a href=\"https://v0-orthophoto.vercel.app/\" target=\"_blank\" rel=\"noopener\">site web</a> pour en savoir plus et télécharger l'application depuis l'App Store.",
  "back-link": "Retour au Blog"
}
